"""
    Дана строка, разбить ее на слова. Слова разделены одним пробелом
    "Александр Сергеевич Пушкин" -> ["Александр", "Сергеевич", "Пушкин"]
"""


def get_words(s: str) -> list[str]:
    return s.split(' ')


if __name__ == '__main__':
    assert get_words('Александр Сергеевич Пушкин') == ['Александр', 'Сергеевич', 'Пушкин']
    assert get_words('Молоко машина возит') == ['Молоко', 'машина', 'возит']
    print('Test passed')