"""
Произведение всех элементов кроме текущего
"""

a = [2, 2, 3, 4]
b = [0, 3, 4, 2]

def product_all(lst: list[int])-> list[int]:
    res = [1]*len(lst)  # Пустой список длины len
    left = 1            # То что стоит слева но для 0 элемента это 1, чтоб не было *0
    for i in range(len(lst)): # Идем слева на право
        res[i] = left         # Пишем каждый раз накопленно произведение все что левее i
        left *= lst[i]        # И тут же домножаем на  текущий i - чтоб для следующего было
                              # произведение всего что слева
    right = 1                 # Тут уже идем в обратном направлении НО по индексам обычным i=3,2,1..
    for i in range(len(lst)-1, -1, -1):
        res[i] *= right       # Берем полседний индекс всего что слева, множим на все что справа
        right *= lst[i]       # Домнажаем сразу на текущий из первоначального списка
    return res                # так получаем произведение все что правее текущего


if __name__ == '__main__':
    assert product_all(a)==[24, 24, 16, 12]
    assert product_all(b)==[24, 0, 0, 0]
    print('All assert pass') 



        

 
print(product_all(a))

    
        
